In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('training_set.csv')
df.head()

   User  Movie  Rating  Timestamp
0     1    661       3  978302109
1     1    914       3  978301968
2     1   3408       4  978300275
3     1   2355       5  978824291
4     1   1287       5  978302039

In [5]:
df_ratings = pd.read_csv('ratings.csv', header=0)

In [6]:
df_ratings.head()

   1  1193  5  978300760
0  1   661  3  978302109
1  1   914  3  978301968
2  1  3408  4  978300275
3  1  2355  5  978824291
4  1  1197  3  978302268